In [2]:
import pandas as pd

df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns=["A", "B", "C"])

In [5]:
df.head(2)

   A  B  C
0  1  2  3
1  4  5  6

In [6]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [7]:
df.describe()

         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [3]:
coffee = pd.read_csv('./warmup-data/coffee.csv')

In [4]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [8]:
results = pd.read_parquet('./data/results.parquet')
bios = pd.read_csv('./data/bios.csv')

In [6]:
results.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,17.0,True,None
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,None
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,32.0,True,None
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,None
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,None

In [11]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [15]:
coffee.loc[5:12, ["Day", "Units Sold"]]

          Day  Units Sold
5   Wednesday          25
6    Thursday          40
7    Thursday          30
8      Friday          45
9      Friday          35
10   Saturday          45
11   Saturday          35
12     Sunday          45

In [16]:
coffee.iloc[:,[0]]

          Day
0      Monday
1      Monday
2     Tuesday
3     Tuesday
4   Wednesday
5   Wednesday
6    Thursday
7    Thursday
8      Friday
9      Friday
10   Saturday
11   Saturday
12     Sunday
13     Sunday

In [18]:
coffee.sort_values("Units Sold", ascending=False)

          Day Coffee Type  Units Sold
10   Saturday    Espresso          45
8      Friday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
11   Saturday       Latte          35
13     Sunday       Latte          35
9      Friday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          15

In [19]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [21]:
bios.loc[bios['height_cm'] > 220]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5673,5696,Gunther Behnke,1963-01-19,Leverkusen,Nordrhein-Westfalen,GER,Germany,221.0,114.0,NaN
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
6978,7013,Arvydas Sabonis,1964-12-19,Kaunas,Kaunas,LTU,Lithuania Soviet Union,223.0,122.0,NaN
89070,89782,Yao Ming,1980-09-12,Xuhui District,Shanghai,CHN,People's Republic of China,226.0,141.0,NaN
89075,89787,Roberto Dueñas,1975-11-01,Madrid,Madrid,ESP,Spain,221.0,137.0,NaN
120266,122147,Zhang Zhaoxu,1987-11-18,Binzhou,Shandong,CHN,People's Republic of China,221.0,110.0,NaN

In [29]:
bios.loc[(bios['born_country'] == 'PAK') & (bios['born_city'] == 'Sialkot')]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
19830,19969,Kamran Ashraf,1973-09-30,Sialkot,Punjab,PAK,Pakistan,171.0,65.0,NaN
19832,19971,Asif Bajwa,1972-06-08,Sialkot,Punjab,PAK,Pakistan,NaN,NaN,NaN
19881,20021,Manzoor Hussain,1958-10-28,Sialkot,Punjab,PAK,Pakistan,173.0,73.0,2022-08-29
19902,20043,Nasir Ali,1959-01-01,Sialkot,Punjab,PAK,Pakistan,176.0,69.0,NaN
19923,20065,Shahnaz Sheikh,1949-03-21,Sialkot,Punjab,PAK,Pakistan,172.0,74.0,NaN
19924,20066,Tariq Sheikh,1968-12-11,Sialkot,Punjab,PAK,Pakistan,160.0,57.0,NaN
19935,20077,Muhammad Zahid Sheikh,1949-12-14,Sialkot,Punjab,PAK,Pakistan,165.0,85.0,2010-01-29
43263,43597,Saifi Chaudhry,1929-11-15,Sialkot,Punjab,PAK,Pakistan,177.0,88.0,NaN
91922,92653,Muhammad Akram,1971-02-02,Sialkot,Punjab,PAK,Pakistan,180.0,72.0,NaN
112649,113927,Muhammad Waqas,1988-09-03,Sialkot,Punjab,PAK,Pakistan,178.0,65.0,NaN
119480,121298,Fareed Ahmed,1989-04-28,Sialkot,Punjab,PAK,Pakistan,NaN,NaN,NaN

In [40]:
bios[bios['name'].str.contains("Awais", case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
48424,48777,Tatsugo Kawaishi,1911-12-10,NaN,NaN,NaN,Japan,NaN,NaN,1945-03-17

In [ ]:
bios.query('born_country == "PAK"')